
#! =============================Логические и условные операторы================================
#* Логические операторы - выражения, которые возвращают True если выражение верное и False если ложно

#* Равенство 
5 == 5 #* True
5 == 10 #* False

#* Неравенство 
5 != 5 #* False
5 != 10 #* True

#* Больше
4 > 5 #* False
5 > 4 #* True

#* Меньше 
4 < 5 #* True
5 < 4 #* False

#* Меньше или равно
4 <= 10 #* True
10 <= 10 #* True

#* Больше или равно
10 >= 4 #* True
4 >= 4 #* True


'5' == 5 #* False
'hello' == 'hello' #* True
'Hello' == 'hello' #* False

#! =====================================and/or/not=============================================
#* and - и, or - или, not - не

a = 5
b = 6

a == 5 and b == 6
