
#! ===========================================TUPLE============================================
#* кортеж - неизменяемый, индексируемый, упорядоченный, итерируемый тип данных, предназначенный для хранения любых данных в определенном порядке (по сути, не отличается от списков, просто он неизменяемый, поэтому занимает меньше памяти)

#* литералы июпла - НЕ СКОБКИ. А запятые
tuple1 = (1, 2, 3, 3, 3, 3)
print(tuple1)
print(type(tuple1)) #* <class 'tuple'>
tuple2 = (4)
print(type(tuple2)) #* <class 'int'>
tuple3 = (4,)
print(type(tuple3)) #* <class 'tuple'>
tuple4 = 1, 2, 3, 4
print(tuple4) #* (1, 2, 3, 4)
print(type(tuple4)) #* <class 'tuple'>
tuple6 = (1, 2, 3, 4, 5, ['hello', 1])
tuple6[-1].append('world')
print(tuple6)

#! ========================================Методы TUPLE=========================================
print(dir(tuple1))

#* count() - метод, который считает количество принятого элемента в кортеже
tuple1 = (1,1,1,1,1,1,1,1,1,1,44,2,42,4,2,2,21,22)
print(tuple1.count(1)) #* 10

#* index() - возвращает индекс первого вхождения принятого элемента
tuple2 = (1, 2, 3, 4, 5, 6, 7, 8, 9, 10)
#* print(tuple1.index(1213))  ValueError: tuple.index(x): x not in tuple
print(tuple1.index(1)) #* 0
